# SiteEditPointsClipped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..SiteEditPointsClipped Property
BuiltInFailures..::..SiteFailures Class See Also
---
Portions of the topographic surface or points on the surface may not be visible in this view due to clipping by the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SiteEditPointsClipped { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SiteEditPointsClipped As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SiteEditPointsClipped {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace